{
  "name": "string", // final name of the harmonized variable generated by concatenating phentoype_concept and concept_variant
  "phenotype_concept": "string", // Concept represented by this variable
  "concept_variant": "integer", // Indicator of which variant of the phenotype concept is being harmonized
  "description": "string", // Short description of this phenotype variable
  "version": "integer", // Version of this harmonized variable
  "dcc_harmonization_id": "integer", // Internal TOPMed DCC identifier for this harmonized variable
  "data_type": "string", // Data type of this variable. One of "string", "decimal", "encoded", or "integer"
  "measurement_units": "string", // Units of measurement for this harmonized variable
  "has_age_variable": "boolean", // Boolean indicator of whether there is an associated age at measurement harmonized with this variable
  "date_harmonized": "2018-08-24 13:46:21", // Date when this variable was harmonized by the TOPMed DCC.
  "dcc_harmonization_comments": "string", // Important information about harmonization in markdown format. Includes a longer description of harmonization, known QC issues, depatures from the specified harmonization description, and study-specific information.
  "encoded_values": [
    {
      "code": "string", // The code used in the data values to represent an encoded value.
      "value": "string" // The meaning of this code.
    } // Special coded values in the data that indicate other meanings.
  ],
  "controlled_vocabulary": [
    {
      "source": "string", // The source of the controlled vocabulary identifier.
      "version": "string", // The version of the controlled vocabulary from which this term came.
      "id": "string" // The identifier used in the specified controlled vocabulary.
    } // A controlled vocabulary term that describes this harmonized variable.
  ],
  "harmonization_units": [
    {
      "name": "string", // The name of this harmonization unit.
      "component_study_variables": [ "string" ], // The set of study dbGaP variables used to create this harmonized variable, in the format phs000000.v0.pht000000.v0.phv00000000.v0.
      "component_harmonized_variables": [
        {
          "dcc_harmonization_id": "integer", // The TOPMed DCC identifier for this component variable.
          "name": "string", // The name of this component variable.
          "version": "integer"
        } // The set of TOPMed DCC harmonized variables used to create this harmonized variable.
      ],
      "harmonization_function": "string" // Definition of the harmonization function in R used to create this harmonized variable.
    } // All information necessary to reproduce TOPMed-DCC harmonized data values for this harmonization unit.
  ]
}
